#!/bin/bash

# fuwari 博客的启动脚本

# 注意：在 Windows 上，您可以使用 Git Bash 或 WSL 来运行此脚本

# 颜色定义
GREEN='\033[0;32m'
YELLOW='\033[1;33m'
RED='\033[0;31m'
NC='\033[0m' # 无颜色
BLUE='\033[36m' # 天蓝色
ZS='\033[35m' # 紫色

# 主页
index() {
    echo "";
    echo "███████╗██╗   ██╗██╗    ██╗ █████╗ ██████╗ ██╗";
    echo "██╔════╝██║   ██║██║    ██║██╔══██╗██╔══██╗██║";
    echo "█████╗  ██║   ██║██║ █╗ ██║███████║██████╔╝██║";
    echo "██╔══╝  ██║   ██║██║███╗██║██╔══██║██╔══██╗██║";
    echo "██║     ╚██████╔╝╚███╔███╔╝██║  ██║██║  ██║██║";
    echo "╚═╝      ╚═════╝  ╚══╝╚══╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝";
    echo "                                              ";
    echo -e "${YELLOW}欢迎使用fuwari 博客的启动脚本${NC}"
    echo -e "${ZS}用法: ./run.sh [选项]${NC}"
    echo "选项："
    echo "  dev       启动开发环境"
    echo "  new-post  创建新文章"
    echo "";
};

run_dev() {
    echo "";
    echo "███████╗██╗   ██╗██╗    ██╗ █████╗ ██████╗ ██╗";
    echo "██╔════╝██║   ██║██║    ██║██╔══██╗██╔══██╗██║";
    echo "█████╗  ██║   ██║██║ █╗ ██║███████║██████╔╝██║";
    echo "██╔══╝  ██║   ██║██║███╗██║██╔══██║██╔══██╗██║";
    echo "██║     ╚██████╔╝╚███╔███╔╝██║  ██║██║  ██║██║";
    echo "╚═╝      ╚═════╝  ╚══╝╚══╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝";
    echo "                                              ";
    sleep 0.2
    echo -e "${BLUE}正在启动开发环境...${NC}"
    sleep 0.5
    pnpm dev
};
run_new-post() {
    echo "";
    echo "███████╗██╗   ██╗██╗    ██╗ █████╗ ██████╗ ██╗";
    echo "██╔════╝██║   ██║██║    ██║██╔══██╗██╔══██╗██║";
    echo "█████╗  ██║   ██║██║ █╗ ██║███████║██████╔╝██║";
    echo "██╔══╝  ██║   ██║██║███╗██║██╔══██║██╔══██╗██║";
    echo "██║     ╚██████╔╝╚███╔███╔╝██║  ██║██║  ██║██║";
    echo "╚═╝      ╚═════╝  ╚══╝╚══╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝";
    echo "                                              ";
    sleep 0.2
    echo -e "${BLUE}正在创建新文章...${NC}"
    echo -e "${YELLOW}请输入文章标题:${NC}"
    read title
    pnpm new-post $title
};
# 主函数
main() {
    # 检查参数
    if [ $# -eq 0 ]; then
        index
        exit 0
    fi
    
    # 根据参数执行相应的函数
    case "$1" in
        dev)
            run_dev
            ;;
        new-post)
            run_new-post
            ;;
        *)
            echo -e "${RED}未知选项: $1${NC}"
            sleep 0.5
            index
            exit 1
            ;;
    esac
};

# 执行主函数
main "$@"
